In [1]:
import pandas as pd
marks_science=[78,56,89,92,45,62]
marks_maths=[78,56,89,92,45,62]
grade=['b','c','a','a','d','b']
data=pd.DataFrame({
    "science marks":marks_science,
    "Maths marks":marks_maths,
    "Total Grade":grade
})

In [4]:
#option 1
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
le.fit(data["Total Grade"])
data["Total Grade"]=le.transform(data['Total Grade'])
data

   science marks  Maths marks  Total Grade
0             78           78            1
1             56           56            2
2             89           89            0
3             92           92            0
4             45           45            3
5             62           62            1

In [5]:
import pandas as pd
aprt_area=[7812,5612,8191,9122,4415,6442]
aprt_price=[78000,56000,89000,92000,45000,62000]
data=pd.DataFrame({
    "Area":aprt_area,
    "Price":aprt_price,
})
data

   Area  Price
0  7812  78000
1  5612  56000
2  8191  89000
3  9122  92000
4  4415  45000
5  6442  62000

In [16]:
import numpy as np
data["Price Category"]=np.where(data["Price"]>60000,'High',
                                np.where(data["Price"]<50000,'low','med'))
data

   Area  Price Price Category
0  7812  78000           High
1  5612  56000            med
2  8191  89000           High
3  9122  92000           High
4  4415  45000            low
5  6442  62000           High